davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    main.c
 * @author  MCD Application Team
 * @brief   BLE application with BLE core
 *
  @verbatim
  ==============================================================================
                    ##### IMPORTANT NOTE #####
  ==============================================================================

  This application requests having the stm32wb5x_BLE_Stack_fw.bin binary
  flashed on the Wireless Coprocessor.
  If it is not the case, you need to use STM32CubeProgrammer to load the appropriate
  binary.

  All available binaries are located under following directory:
  /Projects/STM32_Copro_Wireless_Binaries

  Refer to UM2237 to learn how to use/install STM32CubeProgrammer.
  Refer to /Projects/STM32_Copro_Wireless_Binaries/ReleaseNote.html for the
  detailed procedure to change the Wireless Coprocessor binary.

  @endverbatim
 ******************************************************************************
 * @attention
 *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
 * All rights reserved.</center></h2>
 *
  * This software component is licensed by ST under Ultimate Liberty license 
  * SLA0044, the "License"; You may not use this file except in compliance with 
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/


//This version is for the Living Lab Study.  It needs the following functionality:
//

// (1) on and reporting whenever it connects.
// (2) press and hold to reset it.
// (3) BUTTON 1: initiate survey: time, certainty about time, stress, alertness, max depth of flow, %flow
// (4) BUTTON 2: switch activity: duration guess of current activity, new activity
// (5) BUTTON 3: noticed LED

//DO NOT need separate UI and touch threads; these should happen together.
//DO NOT need a constant loop other than waiting for notify from button presses.


#include "main.h"
#include "cmsis_os.h"
#include "app_entry.h"
#include "app_common.h"

#include "stm32_lpm.h"
#include "dbg_trace.h"
#include "hw_conf.h"
#include "otp.h"
#include "ble.h"

#include "er_oled.h"
#include "dotstar.h"
#include "iqs263.h"
#include "si7021.h"
#include "veml7700.h"

#include "p2p_server_app.h"
#include "p2p_stm.h"

#define NUM_PIXELS 12

I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;
TIM_HandleTypeDef htim1;


//THREADS
// uiControl -- touch and screen update handling.  Send ui events
//              to BLETX, notify esmMain when ui event complete.
//              loop that check for press and mode; faster loop
//              when not resting.

// alert -- led flash and vibrate when notified by esmMain.

// conditionsPoll -- poll lux/whitelux/temp/humd every 10s, send
//                   to BLETX

// BLERX -- update RTC timestamp.  Set bounds for times of day
//          that are okay to query, sleep for day.

// BLETX -- if queue is empty send data over BLE to phone;
//                            if send data fails, queue.
//          otherwise add data to queue and try to send queue.
//          if success, keep sending data until queue is empty
//          and set queue pointer to NULL.
//          accepts either (1) send conditions
//                         (2) send timestamp (use last_timestamp).
//                         (3) send survey result raw 4bits for answer, 4 bits for survey num

// buttonPressed -- send invalidate data/sleep event to BLERX, end
//                  survey, reset mode, restart timer for esm
//                  poll.  any data between this and previous
//                  survey start event is invalidated.

//QUEUES and Global Data Structs

// ProgramMode -- shared between esmMain and uiControl to
// identify what should be on the screen during touch events
// SURVEY STATE -- shared between esmMain and uiControl to
// identify what should be on the screen (if not time estimate)
// LAST TIME ESTIMATE -- last time that time is checked, start here
// when estimating new time
// NOTIFY TIMEBOUNDS -- time bounds for when to have notifications, intervals to estimate
// BLE TX and RX QUEUE -- send data to and from BLE

// SendQueue -- dynamic data of BLE data that hasn't sent

//UI tools -- (1) time estimate based on previous time
//            (2) survey based on Survey_t, with partial screen updates


/* USER CODE BEGIN PV */
/* Definitions for uiControl */
osThreadId_t uiControlHandle;
const osThreadAttr_t uiControl_attributes = {
  .name = "uiControl",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 512 * 4
};
/* Definitions for buttonPress */
osThreadId_t buttonPressHandle;
const osThreadAttr_t buttonPress_attributes = {
  .name = "buttonPress",
  .priority = (osPriority_t) osPriorityAboveNormal,
  .stack_size = 128 * 4
};
/* Definitions for alert */
osThreadId_t alertHandle;
const osThreadAttr_t alert_attributes = {
  .name = "alert",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 8
};
/* Definitions for conditionsPoll */
osThreadId_t conditionsPollHandle;
const osThreadAttr_t conditionsPoll_attributes = {
  .name = "conditionsPoll",
  .priority = (osPriority_t) osPriorityBelowNormal,
  .stack_size = 128 * 8
};
/* Definitions for bleTX */
osThreadId_t bleTXHandle;
const osThreadAttr_t bleTX_attributes = {
  .name = "bleTX",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 128 * 8
};
/* Definitions for bleRX */
osThreadId_t bleRXHandle;
const osThreadAttr_t bleRX_attributes = {
  .name = "bleRX",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 8
};



/* Definitions for bleTXqueue */
osMessageQueueId_t bleTXqueueHandle;
const osMessageQueueAttr_t bleTXqueue_attributes = {
  .name = "bleTXqueue"
};
/* Definitions for bleRXqueue */
//osMessageQueueId_t bleRXqueueHandle; //global
const osMessageQueueAttr_t bleRXqueue_attributes = {
  .name = "bleRXqueue"
};


/* Definitions for rtcMutex */
//osMutexId_t rtcMutexHandle; //global
const osMutexAttr_t rtcMutex_attributes = {
  .name = "rtcMutex"
};
/* Definitions for timeBoundMutex */
osMutexId_t timeBoundMutexHandle;
const osMutexAttr_t timeBoundMutex_attributes = {
  .name = "timeBoundMutex"
};
