davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    		  	  }

    		  	  osDelay(50);


    	} //end touch just done

    }// while we're in ACTIVITY or SURVEY mode, keep spinning here

    } else if (GlobalState.programMode == MODE_ACTIVITY) {

    	interaction_state = 0;

    	//write initial third of screen and options for survey
   	    er_oled_clear(oled_buf);
 	    er_oled_string(0, 0, " GUESS DUR:", 12, 1, oled_buf);
 	    er_oled_display(oled_buf);
 	    //start guess 'hour' at 0

 	    hrs = 0x00;
 	    mins = 0x00;

    	while(GlobalState.programMode == MODE_ACTIVITY) {


    		current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
    		     if (current_minute != -1) { //touch!

    		       if (!touch_end_count){ //START TOUCH EVENT!
    		           //on immediate touch set history to current minute
    		           for (i=0; i < TOUCH_HISTORY_SIZE; i++){
    		        	   minute_history[i] = current_minute;
    		           }
    		       }

    		       touch_end_count = 1;

    		       //put current minute in history buffer and advance circular index
    		       minute_history[history_ind] = current_minute;
    		       history_ind = (history_ind + 1) % TOUCH_HISTORY_SIZE;

    		       //TWO MODES - fast and slow
    		       // if large variation (min and max in buffer > 3 min) set display_time to current_time, else average

    		       //take average of buffer, get min and max; that's what should be displayed
    		       display_minute = 0;
    		       min_minute = 60;
    		       max_minute = 0;
    		       for (i=0; i< TOUCH_HISTORY_SIZE; i++){
    		    	   display_minute += minute_history[i];
    		    	   if (minute_history[i] < min_minute) min_minute = minute_history[i];
    		    	   if (minute_history[i] > max_minute) max_minute = minute_history[i];
    		       }

    		       if (max_minute-min_minute > 4) {
    		    	   display_minute = current_minute;
    		       } else {
    		    	   display_minute /= TOUCH_HISTORY_SIZE;
    		       }

    		       //if last displayed is not what should be displayed, display
    		  	   if (last_display_minute != display_minute) { //UPDATE TOUCH VALUE!

    		           if(interaction_state == 0){
    		        	   //time estimate
    		        	    //hours wrap
							if (display_minute < 15 &&
								display_minute >= 0 &&
								last_display_minute > 45){
								hrs = (hrs+1)%24;

							} else if (display_minute > 45 &&
									   last_display_minute < 15){
								if (hrs==0) {hrs = 0;}
								else {hrs -= 1;}
							}

							//display time on bottom two thirds
							sprintf (time, "%02d%02d", hrs, display_minute);
							er_oled_time_twothird(time, oled_buf);

    		           }else {

							//clear bottom
							er_oled_clear_bottom_third(oled_buf);

							//divide 10-50 min into option steps roughly
							step = 45 / (surveyState.optionArrayLength+1);
							for (i=0; i<surveyState.optionArrayLength; i++){
								//map minute to option
								if(display_minute >= (15 + i*step) &&
								   display_minute < (15 + (i+1)*step)){
									er_oled_string(0, 28, surveyState.optionArray[surveyState.optionArrayLength-1-i], 12, 1, oled_buf);
								}
							}
							er_oled_display(oled_buf);
    		           }


    		           last_display_minute = display_minute;

    		  	   }


    		     } else if (touch_end_count > 0){ //no touch, but touch just happened

    		  	   touch_end_count += 1;//increment touching_end_count

    		  	   if (touch_end_count >= TOUCH_END_TIMEOUT){  //FINISHED/CONFIRMED TOUCH VALUE!
    		  		   uint8_t option = 0xFF;

    		  		   if (interaction_state == 0){
		  		   		   bleSendData.sendType = TX_DURATION_EST;
		  		   		   bleSendData.data = (hrs << 8) | last_display_minute;
		   		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		   		   		   interaction_state = 1;

    		  		   } else{
    		  			 for (i=0; i<surveyState.optionArrayLength; i++){
							 //map minute to option
    		  			   if(last_display_minute >= (15 + i*step) &&
								last_display_minute < (15 + (i+1)*step)){
								 option = surveyState.optionArrayLength-1-i;
							 }
						   }

						   //send to ble
						   bleSendData.sendType = TX_SURVEY_RESULT;
						   bleSendData.data = (surveyState.surveyID << 8) | option;
						   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

						   interaction_state += 1;

    		  		   }


    		  		   touch_end_count = 0;
    		  		   last_display_minute = -1;

    		  		   //based on interaction_state, update survey and/or
    		  		   //put mode to resting to exit
    		  		   er_oled_clear(oled_buf);
    		  		   switch(interaction_state){
    		  		   case 1:
    		  			   er_oled_string(0, 0, "   SURE?", 12, 1, oled_buf);
						   surveyState.surveyID = SURVEY_CONFDUR;
						   memcpy(surveyState.optionArray, opts_confidence, sizeof(opts_confidence));
						   surveyState.optionArrayLength = 5;
    		  			   break;
    		  		   case 2:
    		  			   er_oled_string(0, 0, "COG. EFFORT?", 12, 1, oled_buf);
						   surveyState.surveyID = SURVEY_COGLOAD;
						   memcpy(surveyState.optionArray, opts_arousal, sizeof(opts_arousal));
						   surveyState.optionArrayLength = 5;
    		  			   break;
    		  		   case 3:
    		  			   er_oled_string(0, 0, "  EMOTION?", 12, 1, oled_buf);
						   surveyState.surveyID = SURVEY_EMOTION;
						   memcpy(surveyState.optionArray, opts_valence, sizeof(opts_valence));
						   surveyState.optionArrayLength = 5;
    		  			   break;
    		  		   case 4:
    		  			   er_oled_string(0, 0, " NEXT ACT?", 12, 1, oled_buf);
						   surveyState.surveyID = SURVEY_TIMEFLOW;
						   memcpy(surveyState.optionArray, opts_act, sizeof(opts_act));
						   surveyState.optionArrayLength = 11;
    		  			   break;
    		  		   case 5:
    		  			   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    		  			   GlobalState.programMode = MODE_RESTING;
    		  			   osMutexRelease(modeMutexHandle);
    		  			   break;
    		  		   }
    		  		  er_oled_display(oled_buf);

