davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    		  	  }

    		  	  osDelay(50);


    	} //end touch just done

    }// while we're in ACTIVITY or SURVEY mode, keep spinning here

    }

    //clear the screen before we wait again
    er_oled_clear(oled_buf);
    er_oled_display(oled_buf);

  } //end infinite loop (wait on notify; react)

}/* USER CODE END startUIControl */



/* USER CODE BEGIN Header_startButtonPress */
/**
* @brief Function implementing the buttonPress thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startButtonPress */
void startButtonPress(void *argument)
{
  /* USER CODE BEGIN startButtonPress */
  /* Infinite loop */
  BLETX_Queue_t bleSendData = {TX_PREVIOUS_INVALID, 0x0000};

  //Buttons are PULLED UP and drop to 0 when pressed
  uint8_t buttonState[] = {1, 1, 1};
  uint32_t callingPin = 0x00;
  uint32_t holdValue = 0x00;

  for(;;)
  {
	//wait for rising or falling edge trigger, put calling pin in callingPin
	xTaskNotifyWait(0x00, 0x00, &callingPin, portMAX_DELAY);

	//check state of pin
	GPIO_PinState first_read = HAL_GPIO_ReadPin(GPIOB, callingPin);

	//wait 50ms
    osDelay(50);

    //check again (debounce) to get a good reading
	if (first_read == HAL_GPIO_ReadPin(GPIOB, callingPin)){

		//check that we are actually changing state; the edge trigger should only call
		//when this happens (except during debouncing) so we expect this to be true
		//almost always

		//callingPin can be used as bitmask Pin 5/4/3 give 1000000/10000/1000

		if (callingPin == 0b1000 && !first_read) { //button 1 trigger

				//timeout for release at 6 secs
				holdValue = 0x00;
				xTaskNotifyWait(0b1000, 0x00, &holdValue, pdMS_TO_TICKS(3000));

				if (holdValue > 0x00){
					//released before 6 seconds
					if (GlobalState.programMode == MODE_RESTING){
						osMutexAcquire(modeMutexHandle, portMAX_DELAY);
						GlobalState.programMode = MODE_SURVEY;
						osMutexRelease(modeMutexHandle);

						xTaskNotifyGive(uiControlHandle);
					} else {
						bleSendData.sendType = TX_PREVIOUS_INVALID;
						bleSendData.data = 0x0000;
						osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

						osMutexAcquire(modeMutexHandle, portMAX_DELAY);
						GlobalState.programMode = MODE_RESTING;
						osMutexRelease(modeMutexHandle);
					}

				} else { //took six seconds
					  NVIC_SystemReset();
				}
		}
		if (callingPin == 0b10000 && !first_read) { //button 2 trigger

				//timeout for release at 6 secs
				holdValue = 0x00;
				xTaskNotifyWait(0b10000, 0x00, &holdValue, pdMS_TO_TICKS(3000));

				if (holdValue > 0x00){
					//released before 6 seconds

		    		osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    		GlobalState.programMode = MODE_ACTIVITY;
		    		osMutexRelease(modeMutexHandle);

		    		xTaskNotifyGive(uiControlHandle);

				} else { //took six seconds
					osMutexAcquire(modeMutexHandle, portMAX_DELAY);
					GlobalState.programMode = MODE_VIEW_TIME;
					osMutexRelease(modeMutexHandle);

					xTaskNotifyGive(uiControlHandle);

				}
		}
		if (callingPin == 0b100000 && !first_read) { //button 3 trigger

				//timeout for release at 6 secs
		    	holdValue = 0x00;
		    	xTaskNotifyWait(0b100000, 0x00, &holdValue, pdMS_TO_TICKS(3000));

		    	if (holdValue > 0x00){
		    		//released before 3 seconds

		    		bleSendData.sendType = TX_NOTICED_LED;
		    		bleSendData.data = 0x0000;
		    		osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		    		osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    		GlobalState.programMode = MODE_NOTICED;
		    		osMutexRelease(modeMutexHandle);

		    		xTaskNotifyGive(uiControlHandle);


		    	} else { //took six seconds
		    		  xTaskNotifyGive(alertHandle);
		    	}
		}

	}

  }
  /* USER CODE END startButtonPress */
}

/* USER CODE BEGIN Header_startAlert */
/**
* @brief Function implementing the alert thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startAlert */
void startAlert(void *argument)
{
  /* USER CODE BEGIN startAlert */

  //xTaskNotifyGive(alertHandle); to alert user with flash and vibration

  //HAL_GPIO_WritePin(VIBRATION_GPIO_Port, VIBRATION_Pin, GPIO_PIN_RESET);

  //Init Vibration Motor PWM Parameters
  int duty_cycle = 79; //0 is off, up to ~80
  htim1.Instance->CCR2 = duty_cycle;

  //Dotstar Init
  DotStar_InitHandle dotstar;
  dotstar.spiHandle = &hspi1;
  dotstar.numLEDs = NUM_PIXELS;
  dotstar.colorOrder = DOTSTAR_BGR;
  Dotstar_Init(&dotstar);

  ds_clear();  //turn off
  ds_show();

  const uint8_t MAX_BRIGHTNESS = 0xAA; //max brightness, 0x01-0xFF

  ds_setBrightness(0);

  osDelay(10000);

  ds_clear();  //turn off
  ds_show();

  osDelay(10000);

  ds_clear();  //turn off
  ds_show();

  uint16_t counter;
  uint32_t color;
  uint8_t r,g,b;
  uint8_t LEDDirection, LEDBrightness;

  /* Infinite loop  */
  for(;;)
  {
	ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
	ds_setBrightness(0);
	ds_clear();
	ds_show();

	counter = 0;
	LEDDirection = 0;
	LEDBrightness = 0;

	//flash loop
	ds_fill(0xFFFFFF, 0, 12);

	while (counter++ < MAX_BRIGHTNESS*2) {

		ds_setBrightness(LEDBrightness);
		ds_show();

		//increment color intensity
		if (LEDDirection) {LEDBrightness--;}
		else {LEDBrightness++;}

		//if we hit a limit switch color scaling up or down
		if (LEDBrightness == MAX_BRIGHTNESS) {LEDDirection = 1;}
		if (LEDBrightness == 0x00) {LEDDirection = 0;}

		osDelay(pdMS_TO_TICKS(2)); //2ms delay
	}

	//turn off LEDs
	ds_setBrightness(0);
	ds_fill(0x000000, 0, 12);
	ds_show();

  }
  /* USER CODE END startAlert */
}

/* USER CODE BEGIN Header_startConditionsPoll */
/**
* @brief Function implementing the conditionsPoll thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startConditionsPoll */
void startConditionsPoll(void *argument)
{
	osDelay(500); //let screen start first

	//poll ambient temp, humidity, visible light, white light
	//every 5sec
  	if (veml_Setup(hi2c1, VEML_5S_POLLING) == HAL_ERROR){
  		//error condition
  		strncpy(errorCondition, "ERR:VEML7700", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

